Repository: AdventistChurchFinland/adventistfi-congregations
Catalog: languages/adventistfi-congregations-*.po
Languages: fi

# post type general name
source: Congregations
fi: Seurakunnat

# post type singular name
source: Congregation
fi: Seurakunta

# admin menu
source: Congregations
fi: Seurakunnat

# add new on admin bar
source: Congregation
fi: Seurakunta

# congregations
source: Add New
fi: Lisää uusi

source: Add New Congregation
fi: Lisää uusi seurakunta

source: New Congregation
fi: Uusi seurakunta

source: Edit Congregation
fi: Muokkaa seurakuntaa

source: View Congregation
fi: Näytä seurakunta

source: All Congregations
fi: Kaikki seurakunnat

source: Search Congregations
fi: Hae seurakuntia

source: Parent Congregations:
fi: Hae seurakuntia:

source: No congregations found.
fi: Seurakuntia ei löytynyt.

source: No congregations found in Trash.
fi: Seurakuntia ei löytynyt Roskakorista.

# Taxonomy General Name
source: Language Groups
fi: Kieliryhmät

# Taxonomy Singular Name
source: Language Group
fi: Kieliryhmä

# Taxonomy Menu Name
source: Language Groups
fi: Kieliryhmät

source: All Language Groups
fi: Kaikki kieliryhmät

source: Parent Language Group
fi: Kantakieliryhmä

source: Parent Language Group:
fi: Kantakieliryhmä:

source: New Language Group
fi: Uusi kieliryhmä

source: Add New Language Group
fi: Lisää uusi kieliryhmä

source: Edit Language Group
fi: Muokkaa kieliryhmää

source: Update Language Group
fi: Päivitä kieliryhmä

source: View Language Group
fi: Näytä kieliryhmä

source: Separate language groups with commas
fi: Erottele kieliryhmät pilkuilla

source: Add or remove language groups
fi: Lisää tai poista kieliryhmiä

source: Choose from the most used
fi: Useimmin käytetyt

source: Popular Language Groups
fi: Suositut kieliryhmät

source: Search Language Groups
fi: Hae kieliryhmiä

source: Not Found
fi: Ei löytynyt

source: Adventistfi Congregations
fi: Adventistfi Seurakunnat

source: Custom congregations for adventist.fi
fi: Räätälöidyt seurakunnat adventist.fi sivustolle
